nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_power.h
/*
 * Copyright 2020, NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_POWER_H_
#define _FSL_POWER_H_

#include <stdint.h>
#include "fsl_common.h"
#include "fsl_device_registers.h"

/*!
 * @addtogroup power
 * @{
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief power driver version 2.0.1. */
#define FSL_POWER_DRIVER_VERSION (MAKE_VERSION(2, 0, 1))
/*@}*/

/**
 * @brief Low Power Modes configuration
 */
typedef enum _power_mode_config
{
    kPmu_Sleep          = 0U,
    kPmu_Deep_Sleep     = 1U,
    kPmu_PowerDown      = 2U,
    kPmu_Deep_PowerDown = 3U,
} power_mode_cfg_t;

/**
 * @brief Device Reset Causes
 */
typedef enum _power_reset_cause
{
    kRESET_CAUSE_POR            = 0UL, /*!< Power On Reset */
    kRESET_CAUSE_PADRESET       = 1UL, /*!< Hardware Pin Reset */
    kRESET_CAUSE_BODRESET       = 2UL, /*!< Brown-out Detector reset (either BODVBAT or BODCORE) */
    kRESET_CAUSE_ARMSYSTEMRESET = 3UL, /*!< ARM System Reset */
    kRESET_CAUSE_WDTRESET       = 4UL, /*!< Watchdog Timer Reset */
    kRESET_CAUSE_SWRRESET       = 5UL, /*!< Software Reset */
    kRESET_CAUSE_CDOGRESET      = 6UL, /*!< Code Watchdog Reset */
    /* Reset causes in DEEP-POWER-DOWN low power mode */
    kRESET_CAUSE_DPDRESET_WAKEUPIO = 7UL, /*!< Any of the 5 wake-up pins */
    kRESET_CAUSE_DPDRESET_RTC      = 8UL, /*!< Real Time Clock (RTC) */
    kRESET_CAUSE_DPDRESET_OSTIMER  = 9UL, /*!< OS Event Timer (OSTIMER) */
    kRESET_CAUSE_DPDRESET_WAKEUPIO_RTC =
        10UL, /*!< Any of the 5 wake-up pins and RTC (the 2 events occured within 1 nano-second of each other) */
    kRESET_CAUSE_DPDRESET_WAKEUPIO_OSTIMER =
        11UL, /*!< Any of the 5 wake-up pins and OSTIMER (the 2 events occured within 1 nano-second of each other) */
    kRESET_CAUSE_DPDRESET_RTC_OSTIMER =
        12UL, /*!< Real Time Clock or OS Event Timer (the 2 events occured within 1 nano-second of each other) */
    kRESET_CAUSE_DPDRESET_WAKEUPIO_RTC_OSTIMER = 13UL, /*!< Any of the 5 wake-up pins or RTC or OS Event Timer (the 3
                                                          events occured within 1 nano-second of each other) */
    /* Miscallenous */
    kRESET_CAUSE_NOT_RELEVANT =
        14UL, /*!< No reset cause (for example, this code is used when waking up from DEEP-SLEEP low power mode) */
    kRESET_CAUSE_NOT_DETERMINISTIC = 15UL, /*!< Unknown Reset Cause. Should be treated like "Hardware Pin Reset" from an
                                              application point of view. */
} power_reset_cause_t;

/**
 * @brief Device Boot Modes
 */
typedef enum _power_boot_mode
{
    kBOOT_MODE_POWER_UP =
        0UL, /*!< All non Low Power Mode wake up (Power On Reset, Pin Reset, BoD Reset, ARM System Reset ... ) */
    kBOOT_MODE_LP_DEEP_SLEEP      = 1UL, /*!< Wake up from DEEP-SLEEP Low Power mode */
    kBOOT_MODE_LP_POWER_DOWN      = 2UL, /*!< Wake up from POWER-DOWN Low Power mode */
    kBOOT_MODE_LP_DEEP_POWER_DOWN = 4UL, /*!< Wake up from DEEP-POWER-DOWN Low Power mode */
} power_boot_mode_t;

/**
 * @brief Device wake up pins events
 */
typedef enum _power_wakeup_pin_t
{
    kWAKEUP_PIN_NONE     = 0UL,        /*!< No wake up pin event */
    kWAKEUP_PIN_0        = (1UL << 0), /*!< Wake up pin 0 event */
    kWAKEUP_PIN_1        = (1UL << 1), /*!< Wake up pin 1 event */
    kWAKEUP_PIN_2        = (1UL << 2), /*!< Wake up pin 2 event */
    kWAKEUP_PIN_3        = (1UL << 3), /*!< Wake up pin 3 event */
    kWAKEUP_PIN_4        = (1UL << 4), /*!< Wake up pin 4 event */
    kWAKEUP_PIN_MULTIPLE = 0x1FUL, /*!< More than 1 wake up pins events occured (within 1 nano-second of each other) */
} power_wakeup_pin_t;

/**
 * @brief analog components power modes control during low power modes
 */
typedef enum _power_pd_bit
{
    /* Power Down Vector 0 */
    kPDRUNCFG_PD_DCDC       = (1UL << 0),
    kPDRUNCFG_PD_BIAS       = (1UL << 1),
    kPDRUNCFG_PD_BODCORE    = (1UL << 2),
    kPDRUNCFG_PD_BODVDDMAIN = (1UL << 3),
    kPDRUNCFG_PD_FRO1M      = (1UL << 4),
    kPDRUNCFG_PD_FRO192M    = (1UL << 5),
    kPDRUNCFG_PD_FRO32K     = (1UL << 6),
    kPDRUNCFG_PD_XTAL32K    = (1UL << 7),
    kPDRUNCFG_PD_XTALHF     = (1UL << 8),
    kPDRUNCFG_PD_PLL0       = (1UL << 9),
    kPDRUNCFG_PD_PLL1       = (1UL << 10),
    kPDRUNCFG_PD_USBFSPHY   = (1UL << 11),
    kPDRUNCFG_PD_COMP = (1UL << 13),
    kPDRUNCFG_PD_LDOMEM = (1UL << 16),
    kPDRUNCFG_PD_LDOEFUSEPROG = (1UL << 18),
    kPDRUNCFG_PD_LDOXTALHF  = (1UL << 20),
    kPDRUNCFG_PD_LDOFLASHNV = (1UL << 21),
    kPDRUNCFG_PD_PLL0_SSCG = (1UL << 23),
    kPDRUNCFG_PD_ROM       = (1UL << 24),
    kPDRUNCFG_PD_HSCMP0    = (1UL << 25),
    kPDRUNCFG_PD_HSCMP1    = (1UL << 26),
    kPDRUNCFG_PD_HSCMP2    = (1UL << 27),
    kPDRUNCFG_PD_OPAMP0    = (1UL << 28),
    kPDRUNCFG_PD_OPAMP1    = (1UL << 29),
    kPDRUNCFG_PD_OPAMP2    = (1UL << 30),
    kPDRUNCFG_PD_VREF      = (1UL << 31),

    /* Power Down Vector 1 */
    kPDRUNCFG_PD_CMPBIAS    = (1UL << 0) | (1UL << 31),
    kPDRUNCFG_PD_HSCMP0_DAC = (1UL << 1) | (1UL << 31),
    kPDRUNCFG_PD_HSCMP1_DAC = (1UL << 2) | (1UL << 31),
    kPDRUNCFG_PD_HSCMP2_DAC = (1UL << 3) | (1UL << 31),
    kPDRUNCFG_PD_DAC0       = (1UL << 4) | (1UL << 31),
    kPDRUNCFG_PD_DAC1       = (1UL << 5) | (1UL << 31),
    kPDRUNCFG_PD_DAC2       = (1UL << 6) | (1UL << 31),
    kPDRUNCFG_STOP_DAC0     = (1UL << 7) | (1UL << 31),
    kPDRUNCFG_STOP_DAC1     = (1UL << 8) | (1UL << 31),
    kPDRUNCFG_STOP_DAC2     = (1UL << 9) | (1UL << 31),

    /*
       This enum member has no practical meaning,it is used to avoid MISRA issue,
       user should not trying to use it.
       */
    kPDRUNCFG_ForceUnsigned = 0x80000000U,
} pd_bit_t;

/**
 * @brief SRAM instances bit masks
 */
typedef enum _power_sram_bit
{
    kPOWER_SRAM_RAM_X0        = (1UL << 0),  /*!< RAM_X0 */
    kPOWER_SRAM_RAM_00        = (1UL << 1),  /*!< RAM_00 */
    kPOWER_SRAM_RAM_01        = (1UL << 2),  /*!< RAM_01 */
    kPOWER_SRAM_RAM_02        = (1UL << 3),  /*!< RAM_02 */
    kPOWER_SRAM_RAM_03        = (1UL << 4),  /*!< RAM_03 */
    kPOWER_SRAM_RAM_10        = (1UL << 5),  /*!< RAM_10 */
    kPOWER_SRAM_RAM_20        = (1UL << 6),  /*!< RAM_20 */
    kPOWER_SRAM_RAM_30        = (1UL << 7),  /*!< RAM_30 */
    kPOWER_SRAM_RAM_40        = (1UL << 8),  /*!< RAM_40 */
    kPOWER_SRAM_RAM_41        = (1UL << 9),  /*!< RAM_41 */
    kPOWER_SRAM_RAM_42        = (1UL << 10), /*!< RAM_42 */
    kPOWER_SRAM_RAM_43        = (1UL << 11), /*!< RAM_43 */
    kPOWER_SRAM_FLASHCACHE    = (1UL << 12), /*!< Reserved. Flash Cache SRAM instance */
    kPOWER_SRAM_FLEXSPICACHE  = (1UL << 13), /*!< Reserved. FlexSPI Cache SRAM instance */
    kPOWER_SRAM_FLEXSPIH2PREG = (1UL << 14), /*!< Reserved. FlexSPI Dual Port Register Files instances */

    kPOWER_SRAM_DSLP_MASK = 0x7FFFUL, /*!< Reserved. DEEP-SLEEP SRAM instances */
    kPOWER_SRAM_PDWN_MASK = 0xFFFUL,  /*!< Reserved. POWER-DOWN SRAM instances */

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
    kPOWER_SRAM_DPWD_MASK = 0xFE6UL, /*!< Reserved. DEEP-POWER-DOWN SRAM instances (RAM_X0, RAM_02 and RAM_03 excluded:
                                        they are used by ROM Boot code) */
#else
    kPOWER_SRAM_DPWD_MASK = 0xF3FUL, /*!< Reserved. DEEP-POWER-DOWN SRAM instances (RAM_20 & RAM_30 excluded).*/
#endif

