nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_power.h
 * @return  Nothing
 *
 *          !!! IMPORTANT NOTES :
 *           1 - CPU & System CLock frequency is switched to FRO12MHz and is NOT restored back by the API.
 */
void POWER_EnterDeepSleep(uint32_t exclude_from_pd[2],
                          uint32_t sram_retention_ctrl,
                          uint32_t wakeup_interrupts[4],
                          uint32_t hardware_wake_ctrl);

/**
 * @brief   Configures and enters in POWERDOWN low power mode
 * @param   exclude_from_pd: Defines which analog peripherals shall NOT be powered down (it is a 1 x 32-bit vector,
 aligned with "pd_bit_t" definition)
 * @param   sram_retention_ctrl: Defines which SRAM instances will be put in "retention" mode during power-down (aligned
 with "power_sram_bit_t" definition)
 * @param   wakeup_interrupts: Defines which peripheral interrupts can be a wake-up source during power-down (it is a 2
 x 32-bit vectors, aligned with "WAKEUP_" definition)
 * @param   cpu_retention_addr: Must be:
             - Word aligned (address ending by 0x0, 0x4, 0x8 and 0xC).
             - Between 0x2000_0000 and 0x2000_09FC (inside RAM_00) or
             - Between 0x2000_1000 and 0x2000_19FC (inside RAM_01) or
             - Between 0x2000_2000 and 0x2000_29FC (inside RAM_02) or
             - Between 0x2000_3000 and 0x2000_39FC (inside RAM_03)
             - The CPU state will be stored in SRAM from "cpu_retention_addr" to "cpu_retention_addr + 1540".
               Therefore, any data present in this area before calling the function will be lost.

 * @return  Nothing
 *
 *          !!! IMPORTANT NOTES :
 *           1 - CPU0 & System Clock frequency is switched to FRO12MHz and is NOT restored back by the API.
 *           2 - It is the responsability of the user to make sure that SRAM instance containing the application
 *               software stack and variables WILL BE preserved during low power (via parameter "sram_retention_ctrl")
 */
void POWER_EnterPowerDown(uint32_t exclude_from_pd[1],
                          uint32_t sram_retention_ctrl,
                          uint32_t wakeup_interrupts[4],
                          uint32_t cpu_retention_addr);

/**
 * @brief   Configures and enters in DEEPPOWERDOWN low power mode
 * @param   exclude_from_pd: Defines which analog peripherals shall NOT be powered down (it is a 1 x 32-bit vector,
 aligned with "pd_bit_t" definition)
 * @param   sram_retention_ctrl: Defines which SRAM instances will be put in "retention" mode during deep power-down
 (aligned with "power_sram_bit_t" definition)
 * @param   wakeup_interrupts: Defines which peripheral interrupts can be a wake-up source during deep power-down (it is
 a 2 x 32-bit vectors, aligned with "WAKEUP_" definition)
 * @param   wakeup_io_ctrl: configure the 5 wake-up pins that can wake-up the part from deep power-down mode (see
 "LOWPOWER_WAKEUPIOSRC_*" definition)

 * @return  Nothing
 *
 *          !!! IMPORTANT NOTES :
 *           1 - CPU0 & System Clock frequency is switched to FRO12MHz and is NOT restored back by the API.
 *           2 - The HARD FAULT handler should execute from SRAM. (The Hard fault handler should initiate a full chip
 reset)
 */
void POWER_EnterDeepPowerDown(uint32_t exclude_from_pd[1],
                              uint32_t sram_retention_ctrl,
                              uint32_t wakeup_interrupts[2],
                              uint32_t wakeup_io_ctrl);

/**
 * @brief   Configures the 5 wake-up pins to wake up the part in DEEP-SLEEP and POWER-DOWN low power modes.
 * @param   wakeup_io_cfg_src : for all wake-up pins : indicates if the config is from IOCON (0) or from PMC (1).
 * @param   wakeup_io_ctrl: the 5 wake-up pins configurations (see "LOWPOWER_WAKEUPIOSRC_*" definition)

 * @return  Nothing
 *
 *          !!! IMPORTANT NOTES :
 *           1 - To be called just before POWER_EnterDeepSleep() or POWER_EnterPowerDown().
 */
void POWER_SetWakeUpPins(uint32_t wakeup_io_cfg_src, uint32_t wakeup_io_ctrl);

/**
 * @brief   Return some key information related to the device reset causes / wake-up sources, for all power modes.
 * @param   reset_cause   : the device reset cause, according to the definition of power_reset_cause_t type.
 * @param   boot_mode     : the device boot mode, according to the definition of power_boot_mode_t type.
 * @param   wakeup_pin_cause: the wake-up pin sources, according to the definition of power_wakeup_pin_t  type.

 * @return  Nothing
 *
 */
void POWER_GetWakeUpCause(power_reset_cause_t *reset_cause,
                          power_boot_mode_t *boot_mode,
                          power_wakeup_pin_t *wakeup_pin_cause);

/**
 * @brief   Configures the device internal power control settings
 * @param   system_freq_hz: operating frequency required (in Hertz).
 * @return  Nothing
 *
 *          prepare on-chip power regulators (DC-DC Converter / Core and Always-on
 *          Low Drop-Out regulators)  to deliver the amount of power needed for the
 *          requested performance level, as defined by the CPU operating frequency.
 */
void POWER_SetVoltageForFreq(uint32_t system_freq_hz);

#ifdef __cplusplus
}
#endif

/*! @} */

#endif /* _FSL_POWER_H_ */
